
## :white_check_mark: Apply Succeeded (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9840557439)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.github_repository.current: Reading...
data.github_repository.current: Read complete after 0s [id=dotfiles]
data.github_dependabot_secrets.current: Reading...
github_issue_label.dependencies["major"]: Refreshing state... [id=dotfiles:major]
github_actions_variable.tf_cloud_workspace: Refreshing state... [id=dotfiles:TF_CLOUD_WORKSPACE]
github_issue_label.dependencies["patch"]: Refreshing state... [id=dotfiles:patch]
github_issue_label.dependencies["dependencies"]: Refreshing state... [id=dotfiles:dependencies]
github_branch_protection.main: Refreshing state... [id=BPR_kwDOI-MFls4CWO3H]
github_issue_label.dependencies["minor"]: Refreshing state... [id=dotfiles:minor]
data.github_dependabot_secrets.current: Read complete after 0s [id=dotfiles]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_issue_label.dependencies["terraform-deps"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "CCCCFF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "terraform-deps"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
github_issue_label.dependencies["terraform-deps"]: Creating...
github_issue_label.dependencies["terraform-deps"]: Creation complete after 1s [id=dotfiles:terraform-deps]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":160,"Program":"tfcmt","SHA1":"74efb168f8565e2ded678950818a56778ec35672","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->